Tomas-Kuchta-FPV/HacingTheSAMD20RadnoBoard/src/NRF905-Send/src/packs/ATSAMD20G18_DFP/component/sysctrl.h
#define SYSCTRL_OSC32K_ENABLE_Pos             _UINT32_(1)                                          /* (SYSCTRL_OSC32K) Oscillator Enable Position */
#define SYSCTRL_OSC32K_ENABLE_Msk             (_UINT32_(0x1) << SYSCTRL_OSC32K_ENABLE_Pos)         /* (SYSCTRL_OSC32K) Oscillator Enable Mask */
#define SYSCTRL_OSC32K_ENABLE(value)          (SYSCTRL_OSC32K_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_EN32K_Pos              _UINT32_(2)                                          /* (SYSCTRL_OSC32K) 32kHz Output Enable Position */
#define SYSCTRL_OSC32K_EN32K_Msk              (_UINT32_(0x1) << SYSCTRL_OSC32K_EN32K_Pos)          /* (SYSCTRL_OSC32K) 32kHz Output Enable Mask */
#define SYSCTRL_OSC32K_EN32K(value)           (SYSCTRL_OSC32K_EN32K_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_EN32K_Pos)) /* Assigment of value for EN32K in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_EN1K_Pos               _UINT32_(3)                                          /* (SYSCTRL_OSC32K) 1kHz Output Enable Position */
#define SYSCTRL_OSC32K_EN1K_Msk               (_UINT32_(0x1) << SYSCTRL_OSC32K_EN1K_Pos)           /* (SYSCTRL_OSC32K) 1kHz Output Enable Mask */
#define SYSCTRL_OSC32K_EN1K(value)            (SYSCTRL_OSC32K_EN1K_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_EN1K_Pos)) /* Assigment of value for EN1K in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_RUNSTDBY_Pos           _UINT32_(6)                                          /* (SYSCTRL_OSC32K) Run in Standby Position */
#define SYSCTRL_OSC32K_RUNSTDBY_Msk           (_UINT32_(0x1) << SYSCTRL_OSC32K_RUNSTDBY_Pos)       /* (SYSCTRL_OSC32K) Run in Standby Mask */
#define SYSCTRL_OSC32K_RUNSTDBY(value)        (SYSCTRL_OSC32K_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_ONDEMAND_Pos           _UINT32_(7)                                          /* (SYSCTRL_OSC32K) On Demand Control Position */
#define SYSCTRL_OSC32K_ONDEMAND_Msk           (_UINT32_(0x1) << SYSCTRL_OSC32K_ONDEMAND_Pos)       /* (SYSCTRL_OSC32K) On Demand Control Mask */
#define SYSCTRL_OSC32K_ONDEMAND(value)        (SYSCTRL_OSC32K_ONDEMAND_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_STARTUP_Pos            _UINT32_(8)                                          /* (SYSCTRL_OSC32K) Oscillator Start-Up Time Position */
#define SYSCTRL_OSC32K_STARTUP_Msk            (_UINT32_(0x7) << SYSCTRL_OSC32K_STARTUP_Pos)        /* (SYSCTRL_OSC32K) Oscillator Start-Up Time Mask */
#define SYSCTRL_OSC32K_STARTUP(value)         (SYSCTRL_OSC32K_STARTUP_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_STARTUP_Pos)) /* Assigment of value for STARTUP in the SYSCTRL_OSC32K register */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE3_Val   _UINT32_(0x0)                                        /* (SYSCTRL_OSC32K) 0.092 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE4_Val   _UINT32_(0x1)                                        /* (SYSCTRL_OSC32K) 0.122 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE6_Val   _UINT32_(0x2)                                        /* (SYSCTRL_OSC32K) 0.183 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE10_Val  _UINT32_(0x3)                                        /* (SYSCTRL_OSC32K) 0.305 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE18_Val  _UINT32_(0x4)                                        /* (SYSCTRL_OSC32K) 0.549 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE34_Val  _UINT32_(0x5)                                        /* (SYSCTRL_OSC32K) 1.038 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE66_Val  _UINT32_(0x6)                                        /* (SYSCTRL_OSC32K) 2.014 ms  */
#define   SYSCTRL_OSC32K_STARTUP_CYCLE130_Val _UINT32_(0x7)                                        /* (SYSCTRL_OSC32K) 3.967 ms  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE3         (SYSCTRL_OSC32K_STARTUP_CYCLE3_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.092 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE4         (SYSCTRL_OSC32K_STARTUP_CYCLE4_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.122 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE6         (SYSCTRL_OSC32K_STARTUP_CYCLE6_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.183 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE10        (SYSCTRL_OSC32K_STARTUP_CYCLE10_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.305 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE18        (SYSCTRL_OSC32K_STARTUP_CYCLE18_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 0.549 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE34        (SYSCTRL_OSC32K_STARTUP_CYCLE34_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 1.038 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE66        (SYSCTRL_OSC32K_STARTUP_CYCLE66_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 2.014 ms Position  */
#define SYSCTRL_OSC32K_STARTUP_CYCLE130       (SYSCTRL_OSC32K_STARTUP_CYCLE130_Val << SYSCTRL_OSC32K_STARTUP_Pos) /* (SYSCTRL_OSC32K) 3.967 ms Position  */
#define SYSCTRL_OSC32K_WRTLOCK_Pos            _UINT32_(12)                                         /* (SYSCTRL_OSC32K) Write Lock Position */
#define SYSCTRL_OSC32K_WRTLOCK_Msk            (_UINT32_(0x1) << SYSCTRL_OSC32K_WRTLOCK_Pos)        /* (SYSCTRL_OSC32K) Write Lock Mask */
#define SYSCTRL_OSC32K_WRTLOCK(value)         (SYSCTRL_OSC32K_WRTLOCK_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_CALIB_Pos              _UINT32_(16)                                         /* (SYSCTRL_OSC32K) Oscillator Calibration Position */
#define SYSCTRL_OSC32K_CALIB_Msk              (_UINT32_(0x7F) << SYSCTRL_OSC32K_CALIB_Pos)         /* (SYSCTRL_OSC32K) Oscillator Calibration Mask */
#define SYSCTRL_OSC32K_CALIB(value)           (SYSCTRL_OSC32K_CALIB_Msk & (_UINT32_(value) << SYSCTRL_OSC32K_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSC32K register */
#define SYSCTRL_OSC32K_Msk                    _UINT32_(0x007F17CE)                                 /* (SYSCTRL_OSC32K) Register Mask  */


