Tomas-Kuchta-FPV/HacingTheSAMD20RadnoBoard/src/NRF905-Send/src/packs/ATSAMD20G18_DFP/component/sysctrl.h
/* -------- SYSCTRL_OSCULP32K : (SYSCTRL Offset: 0x1C) (R/W 8) OSCULP32K Control -------- */
#define SYSCTRL_OSCULP32K_RESETVALUE          _UINT8_(0x0F)                                        /*  (SYSCTRL_OSCULP32K) OSCULP32K Control  Reset Value */

#define SYSCTRL_OSCULP32K_CALIB_Pos           _UINT8_(0)                                           /* (SYSCTRL_OSCULP32K) Calibration Value Position */
#define SYSCTRL_OSCULP32K_CALIB_Msk           (_UINT8_(0x1F) << SYSCTRL_OSCULP32K_CALIB_Pos)       /* (SYSCTRL_OSCULP32K) Calibration Value Mask */
#define SYSCTRL_OSCULP32K_CALIB(value)        (SYSCTRL_OSCULP32K_CALIB_Msk & (_UINT8_(value) << SYSCTRL_OSCULP32K_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSCULP32K register */
#define SYSCTRL_OSCULP32K_WRTLOCK_Pos         _UINT8_(7)                                           /* (SYSCTRL_OSCULP32K) Write Lock Position */
#define SYSCTRL_OSCULP32K_WRTLOCK_Msk         (_UINT8_(0x1) << SYSCTRL_OSCULP32K_WRTLOCK_Pos)      /* (SYSCTRL_OSCULP32K) Write Lock Mask */
#define SYSCTRL_OSCULP32K_WRTLOCK(value)      (SYSCTRL_OSCULP32K_WRTLOCK_Msk & (_UINT8_(value) << SYSCTRL_OSCULP32K_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the SYSCTRL_OSCULP32K register */
#define SYSCTRL_OSCULP32K_Msk                 _UINT8_(0x9F)                                        /* (SYSCTRL_OSCULP32K) Register Mask  */


/* -------- SYSCTRL_OSC8M : (SYSCTRL Offset: 0x20) (R/W 32) 8MHz Internal Oscillator (OSC8M) Control -------- */
#define SYSCTRL_OSC8M_RESETVALUE              _UINT32_(0x87070382)                                 /*  (SYSCTRL_OSC8M) 8MHz Internal Oscillator (OSC8M) Control  Reset Value */

#define SYSCTRL_OSC8M_ENABLE_Pos              _UINT32_(1)                                          /* (SYSCTRL_OSC8M) Oscillator Enable Position */
#define SYSCTRL_OSC8M_ENABLE_Msk              (_UINT32_(0x1) << SYSCTRL_OSC8M_ENABLE_Pos)          /* (SYSCTRL_OSC8M) Oscillator Enable Mask */
#define SYSCTRL_OSC8M_ENABLE(value)           (SYSCTRL_OSC8M_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_RUNSTDBY_Pos            _UINT32_(6)                                          /* (SYSCTRL_OSC8M) Run in Standby Position */
#define SYSCTRL_OSC8M_RUNSTDBY_Msk            (_UINT32_(0x1) << SYSCTRL_OSC8M_RUNSTDBY_Pos)        /* (SYSCTRL_OSC8M) Run in Standby Mask */
#define SYSCTRL_OSC8M_RUNSTDBY(value)         (SYSCTRL_OSC8M_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_ONDEMAND_Pos            _UINT32_(7)                                          /* (SYSCTRL_OSC8M) On Demand Control Position */
#define SYSCTRL_OSC8M_ONDEMAND_Msk            (_UINT32_(0x1) << SYSCTRL_OSC8M_ONDEMAND_Pos)        /* (SYSCTRL_OSC8M) On Demand Control Mask */
#define SYSCTRL_OSC8M_ONDEMAND(value)         (SYSCTRL_OSC8M_ONDEMAND_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_PRESC_Pos               _UINT32_(8)                                          /* (SYSCTRL_OSC8M) Oscillator Prescaler Position */
#define SYSCTRL_OSC8M_PRESC_Msk               (_UINT32_(0x3) << SYSCTRL_OSC8M_PRESC_Pos)           /* (SYSCTRL_OSC8M) Oscillator Prescaler Mask */
#define SYSCTRL_OSC8M_PRESC(value)            (SYSCTRL_OSC8M_PRESC_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_PRESC_Pos)) /* Assigment of value for PRESC in the SYSCTRL_OSC8M register */
#define   SYSCTRL_OSC8M_PRESC_0_Val           _UINT32_(0x0)                                        /* (SYSCTRL_OSC8M) 1  */
#define   SYSCTRL_OSC8M_PRESC_1_Val           _UINT32_(0x1)                                        /* (SYSCTRL_OSC8M) 2  */
#define   SYSCTRL_OSC8M_PRESC_2_Val           _UINT32_(0x2)                                        /* (SYSCTRL_OSC8M) 4  */
#define   SYSCTRL_OSC8M_PRESC_3_Val           _UINT32_(0x3)                                        /* (SYSCTRL_OSC8M) 8  */
#define SYSCTRL_OSC8M_PRESC_0                 (SYSCTRL_OSC8M_PRESC_0_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 1 Position  */
#define SYSCTRL_OSC8M_PRESC_1                 (SYSCTRL_OSC8M_PRESC_1_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 2 Position  */
#define SYSCTRL_OSC8M_PRESC_2                 (SYSCTRL_OSC8M_PRESC_2_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 4 Position  */
#define SYSCTRL_OSC8M_PRESC_3                 (SYSCTRL_OSC8M_PRESC_3_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 8 Position  */
#define SYSCTRL_OSC8M_CALIB_Pos               _UINT32_(16)                                         /* (SYSCTRL_OSC8M) Oscillator Calibration Position */
#define SYSCTRL_OSC8M_CALIB_Msk               (_UINT32_(0xFFF) << SYSCTRL_OSC8M_CALIB_Pos)         /* (SYSCTRL_OSC8M) Oscillator Calibration Mask */
#define SYSCTRL_OSC8M_CALIB(value)            (SYSCTRL_OSC8M_CALIB_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_FRANGE_Pos              _UINT32_(30)                                         /* (SYSCTRL_OSC8M) Oscillator Frequency Range Position */
#define SYSCTRL_OSC8M_FRANGE_Msk              (_UINT32_(0x3) << SYSCTRL_OSC8M_FRANGE_Pos)          /* (SYSCTRL_OSC8M) Oscillator Frequency Range Mask */
#define SYSCTRL_OSC8M_FRANGE(value)           (SYSCTRL_OSC8M_FRANGE_Msk & (_UINT32_(value) << SYSCTRL_OSC8M_FRANGE_Pos)) /* Assigment of value for FRANGE in the SYSCTRL_OSC8M register */
#define   SYSCTRL_OSC8M_FRANGE_0_Val          _UINT32_(0x0)                                        /* (SYSCTRL_OSC8M) 4 to 6MHz  */
#define   SYSCTRL_OSC8M_FRANGE_1_Val          _UINT32_(0x1)                                        /* (SYSCTRL_OSC8M) 6 to 8MHz  */
#define   SYSCTRL_OSC8M_FRANGE_2_Val          _UINT32_(0x2)                                        /* (SYSCTRL_OSC8M) 8 to 11MHz  */
#define   SYSCTRL_OSC8M_FRANGE_3_Val          _UINT32_(0x3)                                        /* (SYSCTRL_OSC8M) 11 to 15MHz  */
#define SYSCTRL_OSC8M_FRANGE_0                (SYSCTRL_OSC8M_FRANGE_0_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 4 to 6MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_1                (SYSCTRL_OSC8M_FRANGE_1_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 6 to 8MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_2                (SYSCTRL_OSC8M_FRANGE_2_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 8 to 11MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_3                (SYSCTRL_OSC8M_FRANGE_3_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 11 to 15MHz Position  */
#define SYSCTRL_OSC8M_Msk                     _UINT32_(0xCFFF03C2)                                 /* (SYSCTRL_OSC8M) Register Mask  */


/* -------- SYSCTRL_DFLLCTRL : (SYSCTRL Offset: 0x24) (R/W 16) DFLL Config -------- */
#define SYSCTRL_DFLLCTRL_RESETVALUE           _UINT16_(0x80)                                       /*  (SYSCTRL_DFLLCTRL) DFLL Config  Reset Value */

#define SYSCTRL_DFLLCTRL_ENABLE_Pos           _UINT16_(1)                                          /* (SYSCTRL_DFLLCTRL) Enable Position */
#define SYSCTRL_DFLLCTRL_ENABLE_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_ENABLE_Pos)       /* (SYSCTRL_DFLLCTRL) Enable Mask */
#define SYSCTRL_DFLLCTRL_ENABLE(value)        (SYSCTRL_DFLLCTRL_ENABLE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_MODE_Pos             _UINT16_(2)                                          /* (SYSCTRL_DFLLCTRL) Mode Selection Position */
#define SYSCTRL_DFLLCTRL_MODE_Msk             (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_MODE_Pos)         /* (SYSCTRL_DFLLCTRL) Mode Selection Mask */
#define SYSCTRL_DFLLCTRL_MODE(value)          (SYSCTRL_DFLLCTRL_MODE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_MODE_Pos)) /* Assigment of value for MODE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_STABLE_Pos           _UINT16_(3)                                          /* (SYSCTRL_DFLLCTRL) Stable Frequency Position */
#define SYSCTRL_DFLLCTRL_STABLE_Msk           (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_STABLE_Pos)       /* (SYSCTRL_DFLLCTRL) Stable Frequency Mask */
#define SYSCTRL_DFLLCTRL_STABLE(value)        (SYSCTRL_DFLLCTRL_STABLE_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_STABLE_Pos)) /* Assigment of value for STABLE in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_LLAW_Pos             _UINT16_(4)                                          /* (SYSCTRL_DFLLCTRL) Lose Lock After Wake Position */
#define SYSCTRL_DFLLCTRL_LLAW_Msk             (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_LLAW_Pos)         /* (SYSCTRL_DFLLCTRL) Lose Lock After Wake Mask */
#define SYSCTRL_DFLLCTRL_LLAW(value)          (SYSCTRL_DFLLCTRL_LLAW_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_LLAW_Pos)) /* Assigment of value for LLAW in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_RUNSTDBY_Pos         _UINT16_(6)                                          /* (SYSCTRL_DFLLCTRL) Run during Standby Position */
#define SYSCTRL_DFLLCTRL_RUNSTDBY_Msk         (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_RUNSTDBY_Pos)     /* (SYSCTRL_DFLLCTRL) Run during Standby Mask */
#define SYSCTRL_DFLLCTRL_RUNSTDBY(value)      (SYSCTRL_DFLLCTRL_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_ONDEMAND_Pos         _UINT16_(7)                                          /* (SYSCTRL_DFLLCTRL) Enable on Demand Position */
#define SYSCTRL_DFLLCTRL_ONDEMAND_Msk         (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_ONDEMAND_Pos)     /* (SYSCTRL_DFLLCTRL) Enable on Demand Mask */
#define SYSCTRL_DFLLCTRL_ONDEMAND(value)      (SYSCTRL_DFLLCTRL_ONDEMAND_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_CCDIS_Pos            _UINT16_(8)                                          /* (SYSCTRL_DFLLCTRL) Chill Cycle Disable Position */
#define SYSCTRL_DFLLCTRL_CCDIS_Msk            (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_CCDIS_Pos)        /* (SYSCTRL_DFLLCTRL) Chill Cycle Disable Mask */
#define SYSCTRL_DFLLCTRL_CCDIS(value)         (SYSCTRL_DFLLCTRL_CCDIS_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_CCDIS_Pos)) /* Assigment of value for CCDIS in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_QLDIS_Pos            _UINT16_(9)                                          /* (SYSCTRL_DFLLCTRL) Quick Lock Disable Position */
#define SYSCTRL_DFLLCTRL_QLDIS_Msk            (_UINT16_(0x1) << SYSCTRL_DFLLCTRL_QLDIS_Pos)        /* (SYSCTRL_DFLLCTRL) Quick Lock Disable Mask */
#define SYSCTRL_DFLLCTRL_QLDIS(value)         (SYSCTRL_DFLLCTRL_QLDIS_Msk & (_UINT16_(value) << SYSCTRL_DFLLCTRL_QLDIS_Pos)) /* Assigment of value for QLDIS in the SYSCTRL_DFLLCTRL register */
#define SYSCTRL_DFLLCTRL_Msk                  _UINT16_(0x03DE)                                     /* (SYSCTRL_DFLLCTRL) Register Mask  */


/* -------- SYSCTRL_DFLLVAL : (SYSCTRL Offset: 0x28) (R/W 32) DFLL Calibration Value -------- */
#define SYSCTRL_DFLLVAL_RESETVALUE            _UINT32_(0x00)                                       /*  (SYSCTRL_DFLLVAL) DFLL Calibration Value  Reset Value */

#define SYSCTRL_DFLLVAL_FINE_Pos              _UINT32_(0)                                          /* (SYSCTRL_DFLLVAL) Fine Calibration Value Position */
#define SYSCTRL_DFLLVAL_FINE_Msk              (_UINT32_(0x3FF) << SYSCTRL_DFLLVAL_FINE_Pos)        /* (SYSCTRL_DFLLVAL) Fine Calibration Value Mask */
#define SYSCTRL_DFLLVAL_FINE(value)           (SYSCTRL_DFLLVAL_FINE_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_FINE_Pos)) /* Assigment of value for FINE in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_COARSE_Pos            _UINT32_(10)                                         /* (SYSCTRL_DFLLVAL) Coarse Calibration Value Position */
#define SYSCTRL_DFLLVAL_COARSE_Msk            (_UINT32_(0x3F) << SYSCTRL_DFLLVAL_COARSE_Pos)       /* (SYSCTRL_DFLLVAL) Coarse Calibration Value Mask */
#define SYSCTRL_DFLLVAL_COARSE(value)         (SYSCTRL_DFLLVAL_COARSE_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_COARSE_Pos)) /* Assigment of value for COARSE in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_DIFF_Pos              _UINT32_(16)                                         /* (SYSCTRL_DFLLVAL) Multiplication Ratio Difference Position */
#define SYSCTRL_DFLLVAL_DIFF_Msk              (_UINT32_(0xFFFF) << SYSCTRL_DFLLVAL_DIFF_Pos)       /* (SYSCTRL_DFLLVAL) Multiplication Ratio Difference Mask */
#define SYSCTRL_DFLLVAL_DIFF(value)           (SYSCTRL_DFLLVAL_DIFF_Msk & (_UINT32_(value) << SYSCTRL_DFLLVAL_DIFF_Pos)) /* Assigment of value for DIFF in the SYSCTRL_DFLLVAL register */
#define SYSCTRL_DFLLVAL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SYSCTRL_DFLLVAL) Register Mask  */


