Tomas-Kuchta-FPV/HacingTheSAMD20RadnoBoard/src/NRF905-Send/src/packs/ATSAMD20G18_DFP/component/sysctrl.h
/* -------- SYSCTRL_DFLLMUL : (SYSCTRL Offset: 0x2C) (R/W 32) DFLL Multiplier -------- */
#define SYSCTRL_DFLLMUL_RESETVALUE            _UINT32_(0x00)                                       /*  (SYSCTRL_DFLLMUL) DFLL Multiplier  Reset Value */

#define SYSCTRL_DFLLMUL_MUL_Pos               _UINT32_(0)                                          /* (SYSCTRL_DFLLMUL) Multiplication Value Position */
#define SYSCTRL_DFLLMUL_MUL_Msk               (_UINT32_(0xFFFF) << SYSCTRL_DFLLMUL_MUL_Pos)        /* (SYSCTRL_DFLLMUL) Multiplication Value Mask */
#define SYSCTRL_DFLLMUL_MUL(value)            (SYSCTRL_DFLLMUL_MUL_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_MUL_Pos)) /* Assigment of value for MUL in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_FSTEP_Pos             _UINT32_(16)                                         /* (SYSCTRL_DFLLMUL) Maximum Fine Step Size Position */
#define SYSCTRL_DFLLMUL_FSTEP_Msk             (_UINT32_(0x3FF) << SYSCTRL_DFLLMUL_FSTEP_Pos)       /* (SYSCTRL_DFLLMUL) Maximum Fine Step Size Mask */
#define SYSCTRL_DFLLMUL_FSTEP(value)          (SYSCTRL_DFLLMUL_FSTEP_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_FSTEP_Pos)) /* Assigment of value for FSTEP in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_CSTEP_Pos             _UINT32_(26)                                         /* (SYSCTRL_DFLLMUL) Maximum Coarse Step Size Position */
#define SYSCTRL_DFLLMUL_CSTEP_Msk             (_UINT32_(0x3F) << SYSCTRL_DFLLMUL_CSTEP_Pos)        /* (SYSCTRL_DFLLMUL) Maximum Coarse Step Size Mask */
#define SYSCTRL_DFLLMUL_CSTEP(value)          (SYSCTRL_DFLLMUL_CSTEP_Msk & (_UINT32_(value) << SYSCTRL_DFLLMUL_CSTEP_Pos)) /* Assigment of value for CSTEP in the SYSCTRL_DFLLMUL register */
#define SYSCTRL_DFLLMUL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SYSCTRL_DFLLMUL) Register Mask  */


/* -------- SYSCTRL_DFLLSYNC : (SYSCTRL Offset: 0x30) (R/W 8) DFLL Synchronization -------- */
#define SYSCTRL_DFLLSYNC_RESETVALUE           _UINT8_(0x00)                                        /*  (SYSCTRL_DFLLSYNC) DFLL Synchronization  Reset Value */

#define SYSCTRL_DFLLSYNC_READREQ_Pos          _UINT8_(7)                                           /* (SYSCTRL_DFLLSYNC) Read Request Synchronization Position */
#define SYSCTRL_DFLLSYNC_READREQ_Msk          (_UINT8_(0x1) << SYSCTRL_DFLLSYNC_READREQ_Pos)       /* (SYSCTRL_DFLLSYNC) Read Request Synchronization Mask */
#define SYSCTRL_DFLLSYNC_READREQ(value)       (SYSCTRL_DFLLSYNC_READREQ_Msk & (_UINT8_(value) << SYSCTRL_DFLLSYNC_READREQ_Pos)) /* Assigment of value for READREQ in the SYSCTRL_DFLLSYNC register */
#define SYSCTRL_DFLLSYNC_Msk                  _UINT8_(0x80)                                        /* (SYSCTRL_DFLLSYNC) Register Mask  */


/* -------- SYSCTRL_BOD33 : (SYSCTRL Offset: 0x34) (R/W 32) 3.3V Brown-Out Detector (BOD33) Control -------- */
#define SYSCTRL_BOD33_RESETVALUE              _UINT32_(0x00)                                       /*  (SYSCTRL_BOD33) 3.3V Brown-Out Detector (BOD33) Control  Reset Value */

#define SYSCTRL_BOD33_ENABLE_Pos              _UINT32_(1)                                          /* (SYSCTRL_BOD33) Enable Position */
#define SYSCTRL_BOD33_ENABLE_Msk              (_UINT32_(0x1) << SYSCTRL_BOD33_ENABLE_Pos)          /* (SYSCTRL_BOD33) Enable Mask */
#define SYSCTRL_BOD33_ENABLE(value)           (SYSCTRL_BOD33_ENABLE_Msk & (_UINT32_(value) << SYSCTRL_BOD33_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_HYST_Pos                _UINT32_(2)                                          /* (SYSCTRL_BOD33) Hysteresis Enable Position */
#define SYSCTRL_BOD33_HYST_Msk                (_UINT32_(0x1) << SYSCTRL_BOD33_HYST_Pos)            /* (SYSCTRL_BOD33) Hysteresis Enable Mask */
#define SYSCTRL_BOD33_HYST(value)             (SYSCTRL_BOD33_HYST_Msk & (_UINT32_(value) << SYSCTRL_BOD33_HYST_Pos)) /* Assigment of value for HYST in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_ACTION_Pos              _UINT32_(3)                                          /* (SYSCTRL_BOD33) Action when Threshold Crossed Position */
#define SYSCTRL_BOD33_ACTION_Msk              (_UINT32_(0x3) << SYSCTRL_BOD33_ACTION_Pos)          /* (SYSCTRL_BOD33) Action when Threshold Crossed Mask */
#define SYSCTRL_BOD33_ACTION(value)           (SYSCTRL_BOD33_ACTION_Msk & (_UINT32_(value) << SYSCTRL_BOD33_ACTION_Pos)) /* Assigment of value for ACTION in the SYSCTRL_BOD33 register */
#define   SYSCTRL_BOD33_ACTION_NONE_Val       _UINT32_(0x0)                                        /* (SYSCTRL_BOD33) No action  */
#define   SYSCTRL_BOD33_ACTION_RESET_Val      _UINT32_(0x1)                                        /* (SYSCTRL_BOD33) The BODVDD generates a reset  */
#define   SYSCTRL_BOD33_ACTION_INT_Val        _UINT32_(0x2)                                        /* (SYSCTRL_BOD33) The BODVDD generates an interrupt  */
#define SYSCTRL_BOD33_ACTION_NONE             (SYSCTRL_BOD33_ACTION_NONE_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) No action Position  */
#define SYSCTRL_BOD33_ACTION_RESET            (SYSCTRL_BOD33_ACTION_RESET_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BODVDD generates a reset Position  */
#define SYSCTRL_BOD33_ACTION_INT              (SYSCTRL_BOD33_ACTION_INT_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BODVDD generates an interrupt Position  */
#define SYSCTRL_BOD33_RUNSTDBY_Pos            _UINT32_(6)                                          /* (SYSCTRL_BOD33) Run during Standby Position */
#define SYSCTRL_BOD33_RUNSTDBY_Msk            (_UINT32_(0x1) << SYSCTRL_BOD33_RUNSTDBY_Pos)        /* (SYSCTRL_BOD33) Run during Standby Mask */
#define SYSCTRL_BOD33_RUNSTDBY(value)         (SYSCTRL_BOD33_RUNSTDBY_Msk & (_UINT32_(value) << SYSCTRL_BOD33_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_MODE_Pos                _UINT32_(8)                                          /* (SYSCTRL_BOD33) Operation Modes Position */
#define SYSCTRL_BOD33_MODE_Msk                (_UINT32_(0x1) << SYSCTRL_BOD33_MODE_Pos)            /* (SYSCTRL_BOD33) Operation Modes Mask */
#define SYSCTRL_BOD33_MODE(value)             (SYSCTRL_BOD33_MODE_Msk & (_UINT32_(value) << SYSCTRL_BOD33_MODE_Pos)) /* Assigment of value for MODE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_CEN_Pos                 _UINT32_(9)                                          /* (SYSCTRL_BOD33) Clock Enable Position */
#define SYSCTRL_BOD33_CEN_Msk                 (_UINT32_(0x1) << SYSCTRL_BOD33_CEN_Pos)             /* (SYSCTRL_BOD33) Clock Enable Mask */
#define SYSCTRL_BOD33_CEN(value)              (SYSCTRL_BOD33_CEN_Msk & (_UINT32_(value) << SYSCTRL_BOD33_CEN_Pos)) /* Assigment of value for CEN in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_PSEL_Pos                _UINT32_(12)                                         /* (SYSCTRL_BOD33) Prescaler Select Position */
#define SYSCTRL_BOD33_PSEL_Msk                (_UINT32_(0xF) << SYSCTRL_BOD33_PSEL_Pos)            /* (SYSCTRL_BOD33) Prescaler Select Mask */
#define SYSCTRL_BOD33_PSEL(value)             (SYSCTRL_BOD33_PSEL_Msk & (_UINT32_(value) << SYSCTRL_BOD33_PSEL_Pos)) /* Assigment of value for PSEL in the SYSCTRL_BOD33 register */
#define   SYSCTRL_BOD33_PSEL_DIV2_Val         _UINT32_(0x0)                                        /* (SYSCTRL_BOD33) Divide clock by 2  */
#define   SYSCTRL_BOD33_PSEL_DIV4_Val         _UINT32_(0x1)                                        /* (SYSCTRL_BOD33) Divide clock by 4  */
#define   SYSCTRL_BOD33_PSEL_DIV8_Val         _UINT32_(0x2)                                        /* (SYSCTRL_BOD33) Divide clock by 8  */
#define   SYSCTRL_BOD33_PSEL_DIV16_Val        _UINT32_(0x3)                                        /* (SYSCTRL_BOD33) Divide clock by 16  */
#define   SYSCTRL_BOD33_PSEL_DIV32_Val        _UINT32_(0x4)                                        /* (SYSCTRL_BOD33) Divide clock by 32  */
#define   SYSCTRL_BOD33_PSEL_DIV64_Val        _UINT32_(0x5)                                        /* (SYSCTRL_BOD33) Divide clock by 64  */
#define   SYSCTRL_BOD33_PSEL_DIV128_Val       _UINT32_(0x6)                                        /* (SYSCTRL_BOD33) Divide clock by 128  */
#define   SYSCTRL_BOD33_PSEL_DIV256_Val       _UINT32_(0x7)                                        /* (SYSCTRL_BOD33) Divide clock by 256  */
#define   SYSCTRL_BOD33_PSEL_DIV512_Val       _UINT32_(0x8)                                        /* (SYSCTRL_BOD33) Divide clock by 512  */
#define   SYSCTRL_BOD33_PSEL_DIV1024_Val      _UINT32_(0x9)                                        /* (SYSCTRL_BOD33) Divide clock by 1024  */
#define   SYSCTRL_BOD33_PSEL_DIV2048_Val      _UINT32_(0xA)                                        /* (SYSCTRL_BOD33) Divide clock by 2048  */
#define   SYSCTRL_BOD33_PSEL_DIV4096_Val      _UINT32_(0xB)                                        /* (SYSCTRL_BOD33) Divide clock by 4096  */
#define   SYSCTRL_BOD33_PSEL_DIV8192_Val      _UINT32_(0xC)                                        /* (SYSCTRL_BOD33) Divide clock by 8192  */
#define   SYSCTRL_BOD33_PSEL_DIV16384_Val     _UINT32_(0xD)                                        /* (SYSCTRL_BOD33) Divide clock by 16384  */
#define   SYSCTRL_BOD33_PSEL_DIV32768_Val     _UINT32_(0xE)                                        /* (SYSCTRL_BOD33) Divide clock by 32768  */
#define   SYSCTRL_BOD33_PSEL_DIV65536_Val     _UINT32_(0xF)                                        /* (SYSCTRL_BOD33) Divide clock by 65536  */
#define SYSCTRL_BOD33_PSEL_DIV2               (SYSCTRL_BOD33_PSEL_DIV2_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4               (SYSCTRL_BOD33_PSEL_DIV4_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8               (SYSCTRL_BOD33_PSEL_DIV8_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16              (SYSCTRL_BOD33_PSEL_DIV16_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16 Position  */
#define SYSCTRL_BOD33_PSEL_DIV32              (SYSCTRL_BOD33_PSEL_DIV32_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32 Position  */
#define SYSCTRL_BOD33_PSEL_DIV64              (SYSCTRL_BOD33_PSEL_DIV64_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 64 Position  */
#define SYSCTRL_BOD33_PSEL_DIV128             (SYSCTRL_BOD33_PSEL_DIV128_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 128 Position  */
#define SYSCTRL_BOD33_PSEL_DIV256             (SYSCTRL_BOD33_PSEL_DIV256_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 256 Position  */
#define SYSCTRL_BOD33_PSEL_DIV512             (SYSCTRL_BOD33_PSEL_DIV512_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 512 Position  */
#define SYSCTRL_BOD33_PSEL_DIV1024            (SYSCTRL_BOD33_PSEL_DIV1024_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 1024 Position  */
#define SYSCTRL_BOD33_PSEL_DIV2048            (SYSCTRL_BOD33_PSEL_DIV2048_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2048 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4096            (SYSCTRL_BOD33_PSEL_DIV4096_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4096 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8192            (SYSCTRL_BOD33_PSEL_DIV8192_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8192 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16384           (SYSCTRL_BOD33_PSEL_DIV16384_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16384 Position  */
#define SYSCTRL_BOD33_PSEL_DIV32768           (SYSCTRL_BOD33_PSEL_DIV32768_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32768 Position  */
#define SYSCTRL_BOD33_PSEL_DIV65536           (SYSCTRL_BOD33_PSEL_DIV65536_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 65536 Position  */
#define SYSCTRL_BOD33_LEVEL_Pos               _UINT32_(16)                                         /* (SYSCTRL_BOD33) Threshold Level Position */
#define SYSCTRL_BOD33_LEVEL_Msk               (_UINT32_(0x3F) << SYSCTRL_BOD33_LEVEL_Pos)          /* (SYSCTRL_BOD33) Threshold Level Mask */
#define SYSCTRL_BOD33_LEVEL(value)            (SYSCTRL_BOD33_LEVEL_Msk & (_UINT32_(value) << SYSCTRL_BOD33_LEVEL_Pos)) /* Assigment of value for LEVEL in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_Msk                     _UINT32_(0x003FF35E)                                 /* (SYSCTRL_BOD33) Register Mask  */


/* -------- SYSCTRL_VREG : (SYSCTRL Offset: 0x3C) (R/W 16) VREG Control -------- */
#define SYSCTRL_VREG_RESETVALUE               _UINT16_(0x402)                                      /*  (SYSCTRL_VREG) VREG Control  Reset Value */

#define SYSCTRL_VREG_RUNSTDBY_Pos             _UINT16_(6)                                          /* (SYSCTRL_VREG) Run during Standby Position */
#define SYSCTRL_VREG_RUNSTDBY_Msk             (_UINT16_(0x1) << SYSCTRL_VREG_RUNSTDBY_Pos)         /* (SYSCTRL_VREG) Run during Standby Mask */
#define SYSCTRL_VREG_RUNSTDBY(value)          (SYSCTRL_VREG_RUNSTDBY_Msk & (_UINT16_(value) << SYSCTRL_VREG_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_FORCELDO_Pos             _UINT16_(13)                                         /* (SYSCTRL_VREG) Force LDO Voltage Regulator Position */
#define SYSCTRL_VREG_FORCELDO_Msk             (_UINT16_(0x1) << SYSCTRL_VREG_FORCELDO_Pos)         /* (SYSCTRL_VREG) Force LDO Voltage Regulator Mask */
#define SYSCTRL_VREG_FORCELDO(value)          (SYSCTRL_VREG_FORCELDO_Msk & (_UINT16_(value) << SYSCTRL_VREG_FORCELDO_Pos)) /* Assigment of value for FORCELDO in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_Msk                      _UINT16_(0x2040)                                     /* (SYSCTRL_VREG) Register Mask  */


/* -------- SYSCTRL_VREF : (SYSCTRL Offset: 0x40) (R/W 32) VREF Control A -------- */
#define SYSCTRL_VREF_RESETVALUE               _UINT32_(0x00)                                       /*  (SYSCTRL_VREF) VREF Control A  Reset Value */

#define SYSCTRL_VREF_TSEN_Pos                 _UINT32_(1)                                          /* (SYSCTRL_VREF) Temperature Sensor Output Enable Position */
#define SYSCTRL_VREF_TSEN_Msk                 (_UINT32_(0x1) << SYSCTRL_VREF_TSEN_Pos)             /* (SYSCTRL_VREF) Temperature Sensor Output Enable Mask */
#define SYSCTRL_VREF_TSEN(value)              (SYSCTRL_VREF_TSEN_Msk & (_UINT32_(value) << SYSCTRL_VREF_TSEN_Pos)) /* Assigment of value for TSEN in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_BGOUTEN_Pos              _UINT32_(2)                                          /* (SYSCTRL_VREF) Bandgap Output Enable Position */
#define SYSCTRL_VREF_BGOUTEN_Msk              (_UINT32_(0x1) << SYSCTRL_VREF_BGOUTEN_Pos)          /* (SYSCTRL_VREF) Bandgap Output Enable Mask */
#define SYSCTRL_VREF_BGOUTEN(value)           (SYSCTRL_VREF_BGOUTEN_Msk & (_UINT32_(value) << SYSCTRL_VREF_BGOUTEN_Pos)) /* Assigment of value for BGOUTEN in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_CALIB_Pos                _UINT32_(16)                                         /* (SYSCTRL_VREF) Voltage Reference Calibration Value Position */
#define SYSCTRL_VREF_CALIB_Msk                (_UINT32_(0x7FF) << SYSCTRL_VREF_CALIB_Pos)          /* (SYSCTRL_VREF) Voltage Reference Calibration Value Mask */
#define SYSCTRL_VREF_CALIB(value)             (SYSCTRL_VREF_CALIB_Msk & (_UINT32_(value) << SYSCTRL_VREF_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_VREF register */
#define SYSCTRL_VREF_Msk                      _UINT32_(0x07FF0006)                                 /* (SYSCTRL_VREF) Register Mask  */


/** \brief SYSCTRL register offsets definitions */
#define SYSCTRL_INTENCLR_REG_OFST      _UINT32_(0x00)      /* (SYSCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define SYSCTRL_INTENSET_REG_OFST      _UINT32_(0x04)      /* (SYSCTRL_INTENSET) Interrupt Enable Set Offset */
#define SYSCTRL_INTFLAG_REG_OFST       _UINT32_(0x08)      /* (SYSCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SYSCTRL_PCLKSR_REG_OFST        _UINT32_(0x0C)      /* (SYSCTRL_PCLKSR) Power and Clocks Status Offset */
#define SYSCTRL_XOSC_REG_OFST          _UINT32_(0x10)      /* (SYSCTRL_XOSC) External Multipurpose Crystal Oscillator (XOSC) Control Offset */
#define SYSCTRL_XOSC32K_REG_OFST       _UINT32_(0x14)      /* (SYSCTRL_XOSC32K) 32kHz External Crystal Oscillator (XOSC32K) Control Offset */
#define SYSCTRL_OSC32K_REG_OFST        _UINT32_(0x18)      /* (SYSCTRL_OSC32K) 32kHz Internal Oscillator (OSC32K) Control Offset */
#define SYSCTRL_OSCULP32K_REG_OFST     _UINT32_(0x1C)      /* (SYSCTRL_OSCULP32K) OSCULP32K Control Offset */
#define SYSCTRL_OSC8M_REG_OFST         _UINT32_(0x20)      /* (SYSCTRL_OSC8M) 8MHz Internal Oscillator (OSC8M) Control Offset */
#define SYSCTRL_DFLLCTRL_REG_OFST      _UINT32_(0x24)      /* (SYSCTRL_DFLLCTRL) DFLL Config Offset */
#define SYSCTRL_DFLLVAL_REG_OFST       _UINT32_(0x28)      /* (SYSCTRL_DFLLVAL) DFLL Calibration Value Offset */
#define SYSCTRL_DFLLMUL_REG_OFST       _UINT32_(0x2C)      /* (SYSCTRL_DFLLMUL) DFLL Multiplier Offset */
#define SYSCTRL_DFLLSYNC_REG_OFST      _UINT32_(0x30)      /* (SYSCTRL_DFLLSYNC) DFLL Synchronization Offset */
#define SYSCTRL_BOD33_REG_OFST         _UINT32_(0x34)      /* (SYSCTRL_BOD33) 3.3V Brown-Out Detector (BOD33) Control Offset */
#define SYSCTRL_VREG_REG_OFST          _UINT32_(0x3C)      /* (SYSCTRL_VREG) VREG Control Offset */
#define SYSCTRL_VREF_REG_OFST          _UINT32_(0x40)      /* (SYSCTRL_VREF) VREF Control A Offset */

